<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Bitwarden Desktop DMG.</string>
    <key>Identifier</key>
    <string>com.github.xishie.download.Bitwarden</string>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Bitwarden</string>
        <key>GITHUB_REPO</key>
        <string>bitwarden/clients</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>%GITHUB_REPO%</string>
                <key>asset_regex</key>
                <string>Bitwarden-.*\.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>

        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.bitwarden.desktop"
                    and (
                        certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */
                        or 
                        (certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ 
                        and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ 
                        and certificate leaf[subject.OU] = "LTZ2DNF8XL")
                    )</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>